# Rebar Enable Crank Length Override Method

Source: https://www.revitapidocs.com/2026/155d8318-a3bb-1e1d-1abb-fa098f4ce40e.htm

---

| Rebar Enable Crank Length Override Method |
| --- |

Enables or disables the ability to override crank lengths for this rebar instance.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void EnableCrankLengthOverride(
	bool enable
)
```

```
Public Sub EnableCrankLengthOverride (
	enable As Boolean
)
```

```
public:
void EnableCrankLengthOverride(
	bool enable
)
```

```
member EnableCrankLengthOverride :
        enable : bool -> unit
```

#### Parameters

enable Boolean
:   True to enable, False to disable.

See Also

#### Reference

Rebar Class Autodesk.Revit.DB.Structure Namespace